# Pandas #

- is a fast, powerful, flexible and easy to use open source data analysis and manipulation tool,

- built on top of the Python programming language.

In [1]:
# imports!
import pandas as pd 
import numpy as np

## Series ##

In [2]:
l1 = pd.Series([1,2,3]) #Series defined from a list
l1

0    1
1    2
2    3
dtype: int64

In [3]:
# series back to numpy
l1.values

array([1, 2, 3])

In [4]:
l2 = pd.Series(np.array([1,2,3,4,5,6,7,8])) #Series defined from an array
l2

0    1
1    2
2    3
3    4
4    5
5    6
6    7
7    8
dtype: int64

In [5]:
type(l2)

pandas.core.series.Series

In [6]:
l3 = pd.Series(np.array([1,3,5,7,'',9,11])) #Series can have mixed datatypes, though it would allow only operations on them
print('pandas l3:\n',l3)
print('mean:', l3.mean()) # empty string is a valid value - treated as if zero
print('max:', l3.max())

# Though below would throw an error and not allowed. 
#l4 = pd.Series(np.array([1,'Sandeep',4]))
#l4.mean()

pandas l3:
 0     1
1     3
2     5
3     7
4
5     9
6    11
dtype: object
mean: 193987.2857142857
max: 9

In [7]:
l3.replace("1","2") #multiple funtions like replace available

0     2
1     3
2     5
3     7
4
5     9
6    11
dtype: object

In [8]:
print('#indexing allowed to access the data:',l3[0]) #indexing allowed to access the data
print('#datatype post basic indexing:', type(l3[0]))
print('#DEFAULT series index defined as:', l3.index)
print('#post defined indexing #1:', l3[0:3])
print('#post defined indexing #2:', l3[2:])
print('#post defined indexing #3:', l3[:-1])
print('#post defined indexing #4:', l3[1:-1:2])
print('#post defined indexing #5:', l3[::2])

#indexing allowed to access the data: 1
#datatype post basic indexing: <class 'str'>
#DEFAULT series index defined as: RangeIndex(start=0, stop=7, step=1)
#post defined indexing #1: 0    1
1    3
2    5
dtype: object
#post defined indexing #2: 2     5
3     7
4
5     9
6    11
dtype: object
#post defined indexing #3: 0    1
1    3
2    5
3    7
4
5    9
dtype: object
#post defined indexing #4: 1    3
3    7
5    9
dtype: object
#post defined indexing #5: 0     1
2     5
4
6    11
dtype: object

In [9]:
l4 = pd.Series([1,3,5,7,9], index=['A','B','C','D','E']) # CUSTOM index defined
print('l4[''A'']:',l4['A']) # case-sensitive l4['a'] NOT allowed
print('l4[''B'']:',l4['B']) 
print('l4[''C'']:',l4['C']) 
print('l4[''B'':''D'']:',l4['B':'D']) #Range indexing on custom index allowed

l4[A]: 1
l4[B]: 3
l4[C]: 5
l4[B:D]: B    3
C    5
D    7
dtype: int64

## Dataframes ##

*** Dataframe from list of tuples ***

In [10]:
name = ['Sandeep','Murari','Niya','John','Swarnima']
age = [35, 25, 30, 33, 23]

people = list (zip(name,age))
print(people)
df = pd.DataFrame(data=people, columns=['Name','Age'])
df

[('Sandeep', 35), ('Murari', 25), ('Niya', 30), ('John', 33), ('Swarnima', 23)]

       Name  Age
0   Sandeep   35
1    Murari   25
2      Niya   30
3      John   33
4  Swarnima   23

In [11]:
df.rank() # compute numerical data ranks (1 through n) along axis

   Name  Age
0   4.0  5.0
1   2.0  2.0
2   3.0  3.0
3   1.0  4.0
4   5.0  1.0

*** Data Retrieval from Data Frames ***

In [12]:
# rows can be retrieved via index
df.iloc[0]

Name    Sandeep
Age          35
Name: 0, dtype: object

In [13]:
# columns can be retrieved using names
df ["Name"]

0     Sandeep
1      Murari
2        Niya
3        John
4    Swarnima
Name: Name, dtype: object

In [14]:
print(type(df["Age"])) #each column is a Series!
print("Index access in a Series:",df["Name"][0])

<class 'pandas.core.series.Series'>
Index access in a Series: Sandeep

In [15]:
# index is not unique. Thus, when accessed, if multiple values - gives all
findme = pd.Series(["LEARN","BY","INSIGTH"])
findme = findme.append(pd.Series(["INSIGHT","BY","LEARN"]), ignore_index=True)
findme = findme.append(pd.Series(["LEARNBYINSIGHT"])) #resets index by default on append
print(findme)
print("Row access of Series using index directly:\n",findme[0]) # returns both values (visible)
print("Row access of Series using iloc:\n", findme.iloc[6]) # returns actual index (assume hidden unique)

0             LEARN
1                BY
2           INSIGTH
3           INSIGHT
4                BY
5             LEARN
0    LEARNBYINSIGHT
dtype: object
Row access of Series using index directly:
 0             LEARN
0    LEARNBYINSIGHT
dtype: object
Row access of Series using iloc:
 LEARNBYINSIGHT

In [16]:
df.info() # basic info about dataframe, generally first thing to gauge about

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    5 non-null      object
 1   Age     5 non-null      int64
dtypes: int64(1), object(1)
memory usage: 208.0+ bytes

In [17]:
df2 = pd.DataFrame(data=people)
df2[0] #only allowed when columns are not defined. Thus, df[0] will throw error as Name, Age defined.

0     Sandeep
1      Murari
2        Niya
3        John
4    Swarnima
Name: 0, dtype: object

In [18]:
#Can define any column as index
df.set_index('Name', inplace=True)
df

          Age
Name
Sandeep    35
Murari     25
Niya       30
John       33
Swarnima   23

In [19]:
# cannot do df['Sandeep'] - its not an accessible index
# range around them can be done
df['Sandeep':'Niya']

         Age
Name
Sandeep   35
Murari    25
Niya      30

In [20]:
#loc access can be done (SEE: loc and not iloc => no more numerical index)
df.loc['Sandeep']

Age    35
Name: Sandeep, dtype: int64

In [21]:
#df['Name'] => NOT allowed. No more a column but index
df['Age'] # => Allowed

Name
Sandeep     35
Murari      25
Niya        30
John        33
Swarnima    23
Name: Age, dtype: int64

*** Dataframe from a dictionary ***

In [22]:
educated_dict = { 'Country': [ 'India', 'China', 'United States', 'Malaysia' ],
                  'Educated' : [200001234, 300001234, 100001234, 20001234] }

for k,v in educated_dict.items():
    print (k,v)

df2 = pd.DataFrame(educated_dict)
df2

Country ['India', 'China', 'United States', 'Malaysia']
Educated [200001234, 300001234, 100001234, 20001234]

         Country   Educated
0          India  200001234
1          China  300001234
2  United States  100001234
3       Malaysia   20001234

In [23]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 2 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Country   4 non-null      object
 1   Educated  4 non-null      int64
dtypes: int64(1), object(1)
memory usage: 192.0+ bytes

In [24]:
#df.head() => would give entire data back
df2.head(2)

  Country   Educated
0   India  200001234
1   China  300001234

In [25]:
df2.sample(2) #any 
# df2.tail()  # similar commands

  Country   Educated
1   China  300001234
0   India  200001234

In [26]:
df2["Country"]

0            India
1            China
2    United States
3         Malaysia
Name: Country, dtype: object

*** Dataframe from CSV ***

In [27]:
# The option sep="," is used to indicate field separators
# The file name can be replaced with a URL
df3 = pd.read_csv('./data-files/panda/population.csv',sep=",") 
df3.head()

  Country Name Country Code  Year        Value
0   Arab World          ARB  1960   92490932.0
1   Arab World          ARB  1961   95044497.0
2   Arab World          ARB  1962   97682294.0
3   Arab World          ARB  1963  100411076.0
4   Arab World          ARB  1964  103239902.0

In [28]:
df3.info() #get the jist of data => 14885 rows :thumbsup:

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 14885 entries, 0 to 14884
Data columns (total 4 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Country Name  14885 non-null  object
 1   Country Code  14885 non-null  object
 2   Year          14885 non-null  int64
 3   Value         14885 non-null  float64
dtypes: float64(1), int64(1), object(2)
memory usage: 465.3+ KB

In [29]:
# Random sample of 20 distinct countries from the list
uniqueCountries = df3['Country Name'].unique()
np.random.choice(uniqueCountries, 20)

array(['Singapore', 'Least developed countries: UN classification',
       'Maldives', 'Ireland',
       'Europe & Central Asia (IDA & IBRD countries)', 'Burundi',
       'Brazil', 'South Asia', 'Channel Islands', 'Austria', 'Cuba',
       'Suriname', 'Romania', 'Nigeria', 'Lebanon', 'Bangladesh',
       'French Polynesia', 'Comoros', 'Bulgaria', 'Singapore'],
      dtype=object)

In [30]:
# df3.iloc[0:4]
# The general for of iloc is df.iloc[ row_indexer , col_indexer].
# explicit column selection
df3.iloc[ 0:4, [1,3] ] # same as df3.iloc[ :4, range(1,3) ]

# iloc does not support label-based access. In this case we must drop use loc.
# df.iloc[ 0:1, ['Year','Value']  ] => Invalid

  Country Code        Value
0          ARB   92490932.0
1          ARB   95044497.0
2          ARB   97682294.0
3          ARB  100411076.0

In [31]:
# Boolean Indexing => MASKING
# We select rows that satisfy those boolean conditions (one or multiple) 
# Boolean index can be made from a combination of logical operators of AND &, OR |, NOT ~.
bool1 = df3['Value']>1000000000
bool2 = df3['Year']>2000
df3[bool1 & bool2].sample(5)

                    Country Name Country Code  Year         Value
7682                       India          IND  2009  1.214270e+09
2550         Upper middle income          UMC  2002  2.322322e+09
7675                       India          IND  2002  1.089807e+09
2095   Post-demographic dividend          PST  2003  1.035919e+09
218   Early-demographic dividend          EAR  2007  2.777286e+09

In [32]:
# isin is a useful operator when building a boolean index
selection_condition_3 = df3['Country Name'].isin( ['China','India'] )
df3[selection_condition_3].sample(5)

     Country Name Country Code  Year         Value
7642        India          IND  1969  5.415051e+08
7641        India          IND  1968  5.299673e+08
7646        India          IND  1973  5.930589e+08
4991        China          CHN  1992  1.164970e+09
4971        China          CHN  1972  8.620300e+08

In [33]:
# where is useful when we want to retain the shape of the original table.
# The values that dont match the selection critieria are set to NaN
df3b = df3.where(df3['Year']>2011)
df3b

      Country Name Country Code    Year       Value
0              NaN          NaN     NaN         NaN
1              NaN          NaN     NaN         NaN
2              NaN          NaN     NaN         NaN
3              NaN          NaN     NaN         NaN
4              NaN          NaN     NaN         NaN
...            ...          ...     ...         ...
14880     Zimbabwe          ZWE  2012.0  14710826.0
14881     Zimbabwe          ZWE  2013.0  15054506.0
14882     Zimbabwe          ZWE  2014.0  15411675.0
14883     Zimbabwe          ZWE  2015.0  15777451.0
14884     Zimbabwe          ZWE  2016.0  16150362.0

[14885 rows x 4 columns]

In [34]:
print((df3.describe().mean()).Value)
print((df3.describe().std()).Value)

1046482586.2543526
2594636650.4484024

In [35]:
# countries whose GDP is more than three standard deviations from the average
con1 = df3['Value'] > (-df3.describe().mean()).Value + 3*(df3.describe().std()).Value
df3[con1]

     Country Name Country Code  Year         Value
2613        World          WLD  2008  6.763746e+09
2614        World          WLD  2009  6.847215e+09
2615        World          WLD  2010  6.930657e+09
2616        World          WLD  2011  7.012844e+09
2617        World          WLD  2012  7.097401e+09
2618        World          WLD  2013  7.182860e+09
2619        World          WLD  2014  7.268986e+09
2620        World          WLD  2015  7.355220e+09
2621        World          WLD  2016  7.442136e+09

*** Dataframe from Built-in dataset ***

Packages like sklearn and seaborn come with practice datasets

In [36]:
#Pandas dataframe from iris dataset
from sklearn.datasets import load_iris

iris = load_iris()
print(iris.feature_names) # dataset features 
print(iris.data.shape) # metdata
print(type(iris.data)) # data type

['sepal length (cm)', 'sepal width (cm)', 'petal length (cm)', 'petal width (cm)']
(150, 4)
<class 'numpy.ndarray'>

In [37]:
# Create a pandas dataframe with iris data

df_iris = pd.DataFrame(data=iris.data, columns=iris.feature_names)
df_iris

     sepal length (cm)  sepal width (cm)  petal length (cm)  petal width (cm)
0                  5.1               3.5                1.4               0.2
1                  4.9               3.0                1.4               0.2
2                  4.7               3.2                1.3               0.2
3                  4.6               3.1                1.5               0.2
4                  5.0               3.6                1.4               0.2
..                 ...               ...                ...               ...
145                6.7               3.0                5.2               2.3
146                6.3               2.5                5.0               1.9
147                6.5               3.0                5.2               2.0
148                6.2               3.4                5.4               2.3
149                5.9               3.0                5.1               1.8

[150 rows x 4 columns]

In [38]:
# df_iris.columns
df_iris.info() # dataframe metadata

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 150 entries, 0 to 149
Data columns (total 4 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   sepal length (cm)  150 non-null    float64
 1   sepal width (cm)   150 non-null    float64
 2   petal length (cm)  150 non-null    float64
 3   petal width (cm)   150 non-null    float64
dtypes: float64(4)
memory usage: 4.8 KB

In [39]:
df_iris.describe() # summary of numerical columns
# df.describe(include='all') # some info for string datatype also

,sepal length (cm),sepal width (cm),petal length (cm),petal width (cm)
count,150.000000,150.000000,150.000000,150.000000
mean,5.843333,3.057333,3.758000,1.199333
std,0.828066,0.435866,1.765298,0.762238
min,4.300000,2.000000,1.000000,0.100000
25%,5.100000,2.800000,1.600000,0.300000
50%,5.800000,3.000000,4.350000,1.300000
75%,6.400000,3.300000,5.100000,1.800000
max,7.900000,4.400000,6.900000,2.500000

*** Modifying data in dataframe ***

In [40]:
df_marks = pd.read_csv('./data-files/panda/studentmarks2.csv', sep=",", header=None)
df_marks

         0       1       2
0  sandeep  30.666  45.000
1   swetha  30.666  30.000
2     niya  40.250  25.000
3  swarima  20.000  15.000
4     siva  15.000  34.666
5    lalit  20.000  20.000
6     john  37.000  20.000
7   murari  40.250  15.000
8   sanjay  20.000  20.000
9      sri  20.000  29.000

In [41]:
# setup column names for easy reference
df_marks.columns = ['Name', 'Marks1', 'Marks2']
df_marks

      Name  Marks1  Marks2
0  sandeep  30.666  45.000
1   swetha  30.666  30.000
2     niya  40.250  25.000
3  swarima  20.000  15.000
4     siva  15.000  34.666
5    lalit  20.000  20.000
6     john  37.000  20.000
7   murari  40.250  15.000
8   sanjay  20.000  20.000
9      sri  20.000  29.000

In [42]:
df_marks.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    10 non-null     object
 1   Marks1  10 non-null     float64
 2   Marks2  10 non-null     float64
dtypes: float64(2), object(1)
memory usage: 368.0+ bytes

In [43]:
# Add two new students to the existing data.
df_marks = df_marks.append(pd.DataFrame([['pratul',18,20],['pradeep',25,25] ], columns=['Name','Marks1','Marks2']))
df_marks

      Name  Marks1  Marks2
0  sandeep  30.666  45.000
1   swetha  30.666  30.000
2     niya  40.250  25.000
3  swarima  20.000  15.000
4     siva  15.000  34.666
5    lalit  20.000  20.000
6     john  37.000  20.000
7   murari  40.250  15.000
8   sanjay  20.000  20.000
9      sri  20.000  29.000
0   pratul  18.000  20.000
1  pradeep  25.000  25.000

In [44]:
# Notice that there are common index for two students. 
# 
# There are two ways to avoid this situation:
# Either use ignore_index=True option when appending or reset the index as shown below
# df_marks = df_marks.append(pd.DataFrame( [ ['pratul',18,20],['pradeep',25,25] ], columns=['Name','Marks1','Marks2']), ignore_index=True)
df_marks.reset_index() # # This method does not change df_marks until assigned

    index     Name  Marks1  Marks2
0       0  sandeep  30.666  45.000
1       1   swetha  30.666  30.000
2       2     niya  40.250  25.000
3       3  swarima  20.000  15.000
4       4     siva  15.000  34.666
5       5    lalit  20.000  20.000
6       6     john  37.000  20.000
7       7   murari  40.250  15.000
8       8   sanjay  20.000  20.000
9       9      sri  20.000  29.000
10      0   pratul  18.000  20.000
11      1  pradeep  25.000  25.000

In [45]:
df_marks.iloc[7]

Name      murari
Marks1     40.25
Marks2        15
Name: 7, dtype: object

In [46]:
# add a new column of total marks (derived column)
df_marks["Total"] = df_marks["Marks1"]+df_marks["Marks2"]
df_marks

# few more examples
# df_marks['newCriter'] = df_marks['Marks1']*.5+ df_marks['Marks2']
# df_marks['copy'] = df_marks['Total']
# del df['copy']

      Name  Marks1  Marks2   Total
0  sandeep  30.666  45.000  75.666
1   swetha  30.666  30.000  60.666
2     niya  40.250  25.000  65.250
3  swarima  20.000  15.000  35.000
4     siva  15.000  34.666  49.666
5    lalit  20.000  20.000  40.000
6     john  37.000  20.000  57.000
7   murari  40.250  15.000  55.250
8   sanjay  20.000  20.000  40.000
9      sri  20.000  29.000  49.000
0   pratul  18.000  20.000  38.000
1  pradeep  25.000  25.000  50.000

In [47]:
# assign names as the index
df_marks.set_index(keys=['Name'], inplace=True) # In order to modify the table use the option inplace=True.
df_marks

         Marks1  Marks2   Total
Name
sandeep  30.666  45.000  75.666
swetha   30.666  30.000  60.666
niya     40.250  25.000  65.250
swarima  20.000  15.000  35.000
siva     15.000  34.666  49.666
lalit    20.000  20.000  40.000
john     37.000  20.000  57.000
murari   40.250  15.000  55.250
sanjay   20.000  20.000  40.000
sri      20.000  29.000  49.000
pratul   18.000  20.000  38.000
pradeep  25.000  25.000  50.000

In [48]:
# reset back to normal indexes
df_marks.reset_index(inplace=True)
df_marks

       Name  Marks1  Marks2   Total
0   sandeep  30.666  45.000  75.666
1    swetha  30.666  30.000  60.666
2      niya  40.250  25.000  65.250
3   swarima  20.000  15.000  35.000
4      siva  15.000  34.666  49.666
5     lalit  20.000  20.000  40.000
6      john  37.000  20.000  57.000
7    murari  40.250  15.000  55.250
8    sanjay  20.000  20.000  40.000
9       sri  20.000  29.000  49.000
10   pratul  18.000  20.000  38.000
11  pradeep  25.000  25.000  50.000

In [49]:
# Sorting based on a list of columns is easy. This however does not modify the dataframe.
# In order to modify the table use the option inplace=True.

df_marks.sort_values(by=['Total','Marks1'],ascending=[False,True])

       Name  Marks1  Marks2   Total
0   sandeep  30.666  45.000  75.666
2      niya  40.250  25.000  65.250
1    swetha  30.666  30.000  60.666
6      john  37.000  20.000  57.000
7    murari  40.250  15.000  55.250
11  pradeep  25.000  25.000  50.000
4      siva  15.000  34.666  49.666
9       sri  20.000  29.000  49.000
5     lalit  20.000  20.000  40.000
8    sanjay  20.000  20.000  40.000
10   pratul  18.000  20.000  38.000
3   swarima  20.000  15.000  35.000

In [50]:
df_marks.drop("Total", axis=1)  # not done inplace

       Name  Marks1  Marks2
0   sandeep  30.666  45.000
1    swetha  30.666  30.000
2      niya  40.250  25.000
3   swarima  20.000  15.000
4      siva  15.000  34.666
5     lalit  20.000  20.000
6      john  37.000  20.000
7    murari  40.250  15.000
8    sanjay  20.000  20.000
9       sri  20.000  29.000
10   pratul  18.000  20.000
11  pradeep  25.000  25.000

In [51]:
df_marks

       Name  Marks1  Marks2   Total
0   sandeep  30.666  45.000  75.666
1    swetha  30.666  30.000  60.666
2      niya  40.250  25.000  65.250
3   swarima  20.000  15.000  35.000
4      siva  15.000  34.666  49.666
5     lalit  20.000  20.000  40.000
6      john  37.000  20.000  57.000
7    murari  40.250  15.000  55.250
8    sanjay  20.000  20.000  40.000
9       sri  20.000  29.000  49.000
10   pratul  18.000  20.000  38.000
11  pradeep  25.000  25.000  50.000